<template>
  <div :style="designColor">
    <page-header :title="title" :nav="nav" :action="{ to:'#form', name: 'Заполнить анкету' }" />
    <info-block-img :id="content[0].link" :data="content[0]" position="right" />
    <info-block-icons
      :id="content[1].link"
      :data="content[1]"
      position="right"
    />
    <info-block :id="content[2].link" :data="content[2]" position="right" />
    <info-block :id="content[3].link" :data="content[3]" position="left" />
    <parent-form />
  </div>
</template>

<script>
import PageHeader from '~/components/PageHeader.vue'
import InfoBlock from '~/components/InfoBlock.vue'
import InfoBlockImg from '~/components/InfoBlockImg.vue'
import InfoBlockIcons from '~/components/InfoBlockIcons.vue'
import ParentForm from '~/components/Forms/ParentForm.vue'

export default {
  name: 'EducationPage',
  components: {
    PageHeader,
    InfoBlock,
    InfoBlockImg,
    InfoBlockIcons,
    ParentForm
  },
  data () {
    return {
      designColor: {
        '--theme-color': 'var(--bg-first)',
        '--theme-text-color': 'var(--main-blue)',
        '--theme-block-bg-color': 'var(--bg-first-transparent)'
      },
      title: 'Нам нужен Тьютор',
      content: [
        {
          title: 'Как происходит подбор?',
          link: 'selection',
          content: [
            'Наша платформа содержит базу данных тьюторов, готовых сопровождать детей в школах и детских садах Санкт-петербурга и Ленинградской области.',
            'После того, как мы получим вашу анкету, мы сможем подобрать наиболее подходящего кандидата и организовать ваше знакомство.',
            'В случае удачного подбора, ваши анкеты мы уберём из поиска. Если после знакомства с потенциальным тьютором  по каким-то причинам необходимо будет продолжить поиск, мы постараемся подобрать вам другого подходящего кандидата.'
          ]
        },
        {
          title: 'Как нам найти тьютора?',
          link: 'howFind',
          content: [
            'Чтобы найти тьютора через нашу Платформу, вам нужно заполнить подробную анкету, содержащую вопросы про ребёнка, учреждение и график работы. После заполнения анкеты мы свяжемся с вами и начнём искать для вас подходящего кандидата в тьюторы.'
          ]
        },
        {
          title: 'Сколько это стоит?',
          link: 'howMuch',
          content: [
            'Консультация и подбор подходящего кандидата в тьюторы (в случае удачного подбора) составляет 5000 рублей. Оплата осуществляется через наш сайт, администратор пришлёт вам ссылку на платёжную страницу, когда это потребуется.',
            '5000 рублей'
          ]
        },
        {
          title: 'Что ещё вы можете мне предложить?',
          link: 'more',
          content: [
            'Наш инклюзивный центр проводит онлайн-встречи ресурсных родительских групп для родителей. Прочитать про них подробнее и записаться вы можете по ссылке: https://yom-yom.ru/resource_group',
            'Также мы готовы оказывать индивидуальную супервизорскую поддержку для вашего тьютора. Специалисты нашего центра будут консультировать его по сложным вопросам, возникающим в ходе сопровождения, оказывать методическую поддержку, помогать разрабатывать дополнительные материалы и в случае необходимости проводить наблюдения в учреждении, которое посещает ваш ребёнок. Стоимость индивидуальной супервизорской поддержки тьютора составляет 5000 рублей/месяц. Подать запрос на поддержку для тьютора от специалистов нашего центра вы можете , написав нам на почту: centr.yomyom@gmail.com',
            'Инклюзивный центр «Йом-йом» уже несколько лет проводит Уроки добра в общеобразовательных  школах и детских садах, которые посещают особые дети. Уроки добра - это цикл занятий, направленных на то, чтобы показать детям, что все мы разные, у каждого есть свои особенности и это абсолютно нормально. Подробнее узнать об уроках добра и договориться об их проведении вы можете, написав нам на почту: centr.yomyom@gmail.com (или сделать тут окошко, через которое можно будет сразу на почту написать?)'
          ]
        }
      ]
    }
  },
  computed: {
    nav () {
      return this.content
        .filter(item => item.link)
        .map((item) => {
          return {
            title: item.title,
            link: item.link
          }
        })
    }
  }
}
</script>

<style></style>
