<template>
  <div :style="designColor">
    <slider-full-width :path="slideImg" alt="Слайдшоу на главной" />
    <content-section>
      <div class="welcome">
        <h1>Добро пожаловать на ТьюторХаб</h1>
        <p>
          онлайн-платформу по поиску тьюторов для особых детей в
          Санкт-Петербурге.
        </p>
      </div>
      <div class="add-space" />
      <div class="split">
        <div class="cards">
          <card-color-bg
            v-for="(item, i) in cards"
            :key="i"
            :n="i + 1"
            :title="item.title"
            :desc="item.desc"
            :to="item.to"
          />
        </div>
        <div>
          <h2>О Проекте</h2>
          <p>
            Тьютор для ребёнка с ОВЗ - новая, но уже очень востребованная
            профессия среди помогающих специальностей в России. Тьютор помогает
            особому ребёнку включиться в среду школы или детского сада,
            поддерживает его, объясняет ему правила поведения и общения. Следит
            за тем, чтобы ребёнок осваивал образовательную программу, выполнял
            задания.
          </p>
          <p>
            Создавая эту платформу, мы ставили перед собой следующие задачи:
          </p>
          <ul>
            <li>облегчение поиска и подбора тьюторов для родителей;</li>
            <li>формирование базы квалифицированных тьюторов;</li>
            <li>рост и развитие инклюзивной модели;</li>
            <li>повышение значимости работы тьютора.</li>
          </ul>
          <p>
            Если вы родитель особого ребёнка, если вы тьютор и ищете поддержку,
            если вы хотите помогать детям, став тьютором, если вы просто
            интересуетесь инклюзией - вы обязательно найдёте здесь что-то
            полезное для себя!
          </p>
          <p>
            Платформа ТьюторХаб - один из проектов инклюзивного центра «Йом-йом».
            Подробнее узнать о центра вы можете на сайте: https://yom-yom.ru/
          </p>
        </div>
      </div>
    </content-section>
    <content-section>
      <h2>Почему инклюзия так важна?</h2>
      <p>Инклюзивное образование появилось в мире в 1960-х годах, но в России до сих пор спорят: работает — не работает, хорошо — плохо. Многие люди сомневаются в том, что у особых детей и взрослых могут быть те же потребности, что и у всех остальных — потребность в общении, дружбе, учёбе в школе, в занятости и самореализации. Но даже те, кто знаком с проблемой, убеждены: нормотипичные дети, их родители, воспитатели и учителя не готовы находиться рядом с особыми детьми в обычных детских садах и школах.</p>
      <p>На самом деле это уже не так. Наша практика подтверждает другое: если обычные дети не накручены страхами взрослых, то они легко общаются с особыми детьми. Многие взрослые тоже готовы взаимодействовать с особенными детьми, иногда нужно только им немного помочь.</p>
    </content-section>
    <accordion-block :id="accordion" :data="accordion" />
    <team />
  </div>
</template>

<script>
import CardColorBg from '~/components/Cards/CardColorBg.vue'
import ContentSection from '~/components/ContentSection.vue'
import SliderFullWidth from '~/components/SliderFullWidth.vue'
import AccordionBlock from '~/components/AccordionBlock.vue'
import Team from '~/components/Team.vue'
export default {
  name: 'IndexPage',
  components: { ContentSection, SliderFullWidth, CardColorBg, Team, AccordionBlock },
  data () {
    return {
      designColor: {
        '--theme-block-bg-color': 'var(--bg-first-transparent)'
      },
      slideImg: 'images/mainSlide.jpg',
      cards: [
        {
          title: 'Нам нужен тьютор',
          desc: 'Поможем подобрать подходящего тьютора для вашего ребёнка',
          to: 'for-parents'
        },
        {
          title: 'Хочу стать тьютором',
          desc: 'Присоединяйтесь к нашей базе тьюторов для особых детей',
          to: 'education'
        },
        {
          title: 'Уже работаю тьютором',
          desc: 'Узнайте о группах супервизии для тьюторов и курсах по взаимодействию с особыми детьми',
          to: 'supervision'
        }
      ],
      accordion: {
        // title: 'Хотим поделиться с вами некоторыми тонкостями включения:',
        title: '',
        content: [
          {
            title: 'Когда никто не исключён',
            desc: 'Когда никто не исключен, все дети, независимо от способностей и особенностей, могут ладить между собой.',
            img: 'photo_01.jpg'
          },
          {
            title: 'Дошкольный возраст',
            desc: 'Дошкольный возраст – лучшее время для восприятия детьми особенностей других; в этом возрасте стираются границы в общении детей друг с другом.',
            img: 'photo_02.jpg'
          },
          {
            title: 'Самые результативные занятия ',
            desc: 'Самые результативные занятия с лучшими специалистами не могут заменить детям полноценного общения со сверстниками, нормальная детская жизнь терапевтична сама по себе',
            img: 'photo_03.jpg'
          },
          {
            title: 'Общение и игра',
            desc: 'Общение и игра с «особыми» детьми помогают «обычным» детям стать добрее, улучшить собственные навыки общения и игры, научиться заботиться о других людях.',
            img: 'photo_04.jpg'
          },
          {
            title: 'Включение особых детей',
            desc: 'Включение особых детей - это ситуация выигрыша обеих сторон, стратегия win-win («победа-победа»), нет каких-либо жертв или потерь со стороны «обычных» детей, только приобретения.',
            img: 'photo_05.jpg'
          },
          {
            title: 'Инклюзивные подходы',
            desc: 'Инклюзивные подходы помогают нормализовать не только жизнь детей, но и родителей. Счастливые родители - путь к счастливым детям.',
            img: 'photo_06.jpg'
          },
          {
            title: 'Трудные вопросы и ситуации',
            desc: 'Трудные вопросы и ситуации случаются у всех родителей, обычные дети имеют характеры и особенности, сотрудники могут болеть и уставать. А инклюзивная среда дружественна, поддерживает и питает всех, особых и обычных, детей и взрослых, родителей и сотрудников.',
            img: 'photo_07.jpg'
          },
          {
            title: 'Методики и практики инклюзии',
            desc: 'Методики и практики инклюзии применимы в обычных группах детских садов и в школьных классах.',
            img: 'photo_08.jpg'
          }
        ]
      }
    }
  }
}
</script>
<style scoped>
.split {
  display: grid;
  grid-template-columns: repeat(2, 1fr);
  grid-gap: 5em;
}
.cards {
  display: grid;
  grid-gap: 3em;
}
h1 {
  text-align: center;
  font-size: 4em;
  margin-bottom: .5rem;
}
.welcome{
  padding-bottom: 4em;
}
.welcome p{
  text-align: center;
  font-size: 1.7em;
  font-weight: 200;
  text-align: justify;
  text-justify: distribute
}
li{
  font-size: 1.5em;
}
</style>
